"""
Convención de valores:
 0: Espacio libre / camino
 1: Pared / obstáculo
 2: Punto de salida (inicio)
 3: Punto de meta (objetivo)
"""

LABERINTO_EJEMPLO_10X10 = [
    [2, 1, 1, 1, 0, 0, 1, 1, 1, 1],
    [0, 0, 0, 1, 1, 1, 0, 0, 1, 0],
    [1, 1, 0, 0, 0, 1, 0, 1, 1, 1],
    [0, 1, 1, 1, 0, 1, 0, 1, 0, 1],
    [1, 1, 0, 1, 0, 1, 0, 0, 1, 1],
    [0, 0, 0, 1, 0, 3, 1, 0, 1, 0],
    [1, 1, 1, 1, 1, 0, 1, 0, 1, 1],
    [1, 0, 0, 0, 0, 1, 1, 1, 0, 1],
    [1, 1, 1, 1, 1, 1, 0, 1, 0, 1],
    [1, 0, 1, 0, 1, 0, 1, 1, 1, 1]
]

LABERINTO_PRUEBA_3X3 = [
    [2, 1, 0],
    [0, 1, 0],
    [0, 0, 3]
]